do
 function run(msg, matches)
return [[ 
⚪️!azan [شهر ]
⚫️نشان دادن ساعات نماز شهر مورد نظر در انگلیسی وارد کنید
⚪️!praytime [شهر ]
⚫️نمایش اوقات شرعی شهر مورد نظر به انگلیسی وارد کنید
⚪️!arz
⚫️نمایش قیمت ارز
⚪️!weather [شهر ]
⚫️نمایش اب و هوایه شهر مورد نظر به انگلیسی وارد کنید
⚪️!aparat [فیلم مورد نظر]
⚫️جستجو از آپارات 
⚪️!time
⚫️نشان دادن ساعت
⚪️!trfa [متن ]
⚫️ترجمه متن از انگلیسی به فارسی
⚪️!map [شهر ]
⚫️دریافت نقشه شهر مورد نظر
⚪️!gif [متن]
⚫️ساخت گیف دلخواه خود

👑 @cliTEAM 👑
]]
end
return {
patterns = {
"^[!/#][Ff]un$",
"^[Ff]un$"
},
run = run
}
end
