do
 function run(msg, matches)
return [[ 
دومین راهنمای سوپر گروه
#maguser
🔰نشان دادن 3 نفر فعال گروه(عکس،فیلم...)🔰
------------------
#setdes [text]
🔰تنظیم دسکریپشن گروه🔰
------------------
#addsudo

🔰اگر مشکلی داشتید این دستور را بزنید سازنده به گروه دعوت میشود🔰
------------------
#setpass [pass

🔰ساخت پسورد برایه سوپر گروه🔰
➖➖➖➖➖➖
Help
  🔰نمایش لیست راهنمایی🔰
➖➖➖➖➖➖
میتوانید قبل از دستورات از ! و / و # استفاده کنید
خرید گروه یا ربات :
@shereyder
اگر ریپورت هستید 
@shereyder_bot

]]
end
return {
patterns = {
"^[!/#][Gg]phelp2$",
"^[Gg]phelp2$"
},
run = run
}
end
