do
    
function run(msg, matches)
  local help = [[

راهنمای سوپر گروه
#gpinfo
🔰اطلاعاتی در مورد گروه🔰
------------------
#admins
🔰لیست ادمین های سوپر گروه🔰
------------------
#setadmin [reply]
🔰تنظیم ادمین سوپر گروه🔰
------------------
#owner
🔰مالک سوپر گروه🔰
------------------
#setowner [id|user|reply]
🔰تنظیم مالک سوپر گروه🔰
------------------
#modlist
🔰لیست مدیران🔰
------------------
#bots
🔰لیست ربات ها در سوپر گروه🔰
------------------
#bot [lock|unlock]
🔰قفل|باز کردن ربات در سوپر گروه🔰
------------------
#who
🔰لیست کل کاربران در سوپر گروه🔰
------------------
#block
🔰اخراج شخص از سوپر گروه🔰
(ورود شخص به لیست مسدودان)
------------------
#ban 
🔰مسدود کردن شخص از سوپر گروه با یوزر نیم و ایدی🔰
------------------
#unban
🔰حذف مسدودی شخص از سوپر گروه با ایدی و یوزر نیم🔰
------------------
#id
🔰ایدی سوپر گروه (و ایدی شخص با ریپلی)🔰
------------------
#id from
🔰ایدی شخص فوروارد کننده پیام🔰

#promote [username|id]
🔰ارتقاع کاربر به مدیر سوپر گروه🔰
------------------
#demote [username|id]
🔰حذف مدیر سوپر گروه🔰
------------------
#setname [name]
🔰تنظیم نام گروه🔰
------------------
#setphoto 
🔰تنظیم عکس گروه🔰
------------------
#setrules [rules]
🔰تنظیم قوانین گروه🔰
------------------
#setabout [about]
🔰تنظیم موضوع گروه🔰
------------------
#save [value] <text>
🔰یادداشت متن های گروه🔰
------------------
#get [value]
🔰مشاهده یک متن گروه🔰
------------------
#newlink
🔰ساخت لینک جدید🔰
------------------
#link
🔰لینک فعلی گروه🔰
------------------

#rules
🔰قوانین گر‌وه🔰
------------------
#lock [links|flood|spam|arabic|member|rtl|sticker|contacts|strict|tgservice|fwd|reply|fosh|operator|emoji]
🔰قفل موارد بالا🔰
------------------
#unlock [links|flood|spam|arabic|member|rtl|sticker|contacts|strict|tgservice|fwd|reply|fosh|operator|emoji ]
🔰باز کردن موارد بالا🔰

#mute [all|audio|gifs|photo|video|text|tgservice]
🔰موت موارد بالا🔰

#unmute [all|audio|gifs|photo|video|text|tgservice]
🔰لغو موت موارد بالا🔰
------------------
#setflood [value]
🔰تنظیم اندازه حساسیت اسپم🔰
------------------
#settings
🔰تنظیمات سوپر گروه🔰
------------------
#muteslist
🔰لیست موت های سوپر گروه+دیدن لیسا قفل موارد جانبی مانند قفل لینک،قفل یوزرنیم،قفل تگ و...🔰
------------------
#silent [username|id|reply]
unsilent [username|id|reply]
🔰موت و باز کردن موت شخصی🔰
------------------
#silentlist
🔰لیست کاربران موت شده🔰
------------------
#banlist 
🔰لیست مسدودان🔰
------------------
#clean [rules|about|modlist|silentlist]
🔰پاک کردن موارد بالا🔰
------------------
#del 
🔰پاک کردن یک پیام با ریپلی🔰
------------------
#public [yes|no]
🔰خصوصی و عمومی کردن سوپر گروه🔰
------------------
#res [username]
🔰ایدی شخص با یوزرنیم🔰
------------------
#log
🔰لوگ سوپر گروه🔰
------------------
#filter [text]
🔰فیلتر کردن متن🔰
#unfilter [text]
🔰پاک کردن از فیلتر🔰
------------------
#filterlist
🔰لیست متن های فیلتر شده🔰

➖➖➖➖➖➖
Help
  🔰نمایش لیست راهنمایی🔰
➖➖➖➖➖➖
میتوانید قبل از دستورات از ! و / و # استفاده کنید
خرید گروه یا ربات :
@shereyder
اگر ریپورت هستید 
@shereyder_bot]]
    if matches[1] == 'help' and is_sudo(msg) then
      send_large_msg("user#id"..msg.from.id, help)      
   return 'لیست دستورات برایه پی وی شما ارسال شد✉️'
    end
end 

return {
  patterns = {
    "^[!/#](help) pv$",
    "^(help) pv$"
  },
  run = run
}
end
