do
 function run(msg, matches)
return [[
 نرخ گروه با بات 
➖➖➖➖➖➖➖➖➖➖➖➖
نرخ سوپر گروه
قیمت سوپر گروه ها یک هفته 2000تومان 
یعنی:
یک ماه : 5000 تومان
دو ماه : 10000 تومان
سه ماه : 12000 تومان
دائمی : 16000 تومان
➖➖➖➖➖➖➖➖➖➖➖➖
نرخ ادمینی در ربات 
یک ماه : 15000تومان
دو ماه :28000 تومان
➖➖➖➖➖➖➖➖➖➖➖➖
نکته: اگر قبل از کمک گرفتن از ما ربات را از گروه اخراج کنید 
هزینه برگرداندن ربات 3000 تومان می باشد
➖➖➖➖➖➖➖➖➖➖➖➖
اگر در روند کار ربات خطایی دیدید یا اختلال بود با عنوان 
اختلال ربات در یک پیام به ما گزارش دهید 
در اصرع قت رفع خواهد شد 
➖➖➖➖➖➖➖➖➖➖➖➖
برای خرید به ایدی های زیر مراجعه کنید
@shereyder
اگر ریپورت هستید به ربات زیر مراجعه کنید
@SHEREYDER_BOT

پرداخت از طریق:
        شارژ (2هزار تومن اضافه)
       کارت به کارت(قیمت اصلی)
       درگاه پرداخت(بزودی)

جهت مشاهده اخبار ربات و اپدیت ها و ... حتما در کانال عضو شوید    
@cliTEAM
]]
end
return {
patterns = {
"^[!/#][Nn]erkh$",
"^[Nn]erkh$"
},
run = run
}
end
